Public Attributes | List of all members
API_CalcLengthFormat Struct Reference
Project Settings
The API_CalcUnitPrefs structure contains this structure. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_LengthTypeID  | unit
The type of the length measurement unit.
API_ExtraAccuracyID  | accuracy
European methods for rounding decimal values.
short  | decimals
Number of decimals for length measurement unit [0..4].
short  | roundInch
fractional inches (1, 2, 4, 8, 16, 32, 64)
Detailed Description
The API_CalcUnitPrefs structure contains this structure.
Member Data Documentation
◆ accuracy
 API_CalcLengthFormat::accuracy
European methods for rounding decimal values.
◆ decimals
 API_CalcLengthFormat::decimals
Number of decimals for length measurement unit [0..4].
◆ roundInch
 API_CalcLengthFormat::roundInch
fractional inches (1, 2, 4, 8, 16, 32, 64)
◆ unit
 API_CalcLengthFormat::unit
The type of the length measurement unit.